# Начальная телефонная книга
phone_book = {
    "Мама": "+7-999-123-45-67",
    "Папа": "+7-999-234-56-78",
    "Директор": "+7-999-345-67-89"
}

# Твои задачи:
# 1. Вывести номер Мамы
# 2. Добавить нового друга "Антон": "+7-999-456-78-90"
# 3. Удалить контакт "Директор"
# 4. Изменить номер Папы на "+7-999-111-22-33"
# 5. Вывести ВСЕ имена (ключи)
# 6. Вывести ВСЕ номера (значения)
# 7. Проверить, есть ли контакт "Сестра" (без ошибки)


#1=====================================================
func = phone_book.get('Мама')
print(func)



#2================================================
phone_book['Антон'] = '+7-999-111-22-23'
print(phone_book)


#3=====================================================================
name = 'Папа'
phone = '+7-999-888-77-66'

for name in phone_book:
    phone_book['Папа'] = phone
    print(f'Контакт с именем Папа успещно изменен на номер {phone}')
    break
else:
    print(f'Контакт под именем Папа не найден')

#4=======================================================================
all_names = phone_book.keys()
print(all_names)

#5=========================
all_numbers=  phone_book.values()
print(all_numbers)

#6=======================================================
if not 'Сестра' in phone_book:
    print('Not contact')
